/** @file
  String definitions for Sio Configuration form.

;******************************************************************************
;* Copyright (c) 2013-2015, Insyde Software Corporation. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

#langdef en-US "en-USlish"
#langdef fr-FR "fr-FRncais"

#string STR_DEVICE_PATH                 #language en-US        ""

#string STR_SIO_TITLE                   #language en-US        "SIO"
                                        #language fr-FR        "SIO"
#string STR_SIO_ITE8786E_TITLE          #language en-US        "SIO IT8987E"
                                        #language fr-FR        "SIO IT8987E"

#string STR_SIO_TITLE_HELP              #language en-US        "About SuperIO Setting"
                                        #language fr-FR        "About SuperIO Setting"

#string STR_SIO_BAUD_RATE               #language en-US        "Select The Baud Rate"
                                        #language fr-FR        "Select The Baud Rate"
#string STR_SIO_BAUD_HELP               #language en-US        "Set the Baud Rate"
                                        #language fr-FR        "Set the Baud Rate"

#string STR_SIO_SERIAL_PORT             #language en-US        "Serial Port"
                                        #language fr-FR        "Serial Port"
#string STR_SIO_SERIAL_PORTA            #language en-US        "Serial Port A"
                                        #language fr-FR        "Serial Port A"
#string STR_SIO_SERIAL_PORTB            #language en-US        "Serial Port B"
                                        #language fr-FR        "Serial Port B"
#string STR_SIO_SERIAL_PORTC            #language en-US        "Serial Port C"
                                        #language fr-FR        "Serial Port C"
#string STR_SIO_SERIAL_PORTD            #language en-US        "Serial Port D"
                                        #language fr-FR        "Serial Port D"
#string STR_SIO_SERIAL_PORTE            #language en-US        "Serial Port E"
                                        #language fr-FR        "Serial Port E"
#string STR_SIO_SERIAL_PORTF            #language en-US        "Serial Port F"
                                        #language fr-FR        "Serial Port F"

#string STR_SIO_LPT_PORT                #language en-US        "LPT Port"
                                        #language fr-FR        "LPT Port"
#string STR_SIO_LPT_PORTA               #language en-US        "LPT Port A"
                                        #language fr-FR        "LPT Port A"
#string STR_SIO_LPT_PORTB               #language en-US        "LPT Port B"
                                        #language fr-FR        "LPT Port B"
                                        
#string STR_SIO_CIR                     #language en-US        "CIR"
                                        #language fr-FR        "CIR"
#string STR_SIO_IR                      #language en-US        "IR"
                                        #language fr-FR        "IR"     
#string STR_SIO_CIR_HELP                #language en-US        "CIR is used in the consumer remote control equipment, and is a programmable amplitude shift keyed (ASK) serial communication protocol"
                                        #language fr-FR        "CIR is used in the consumer remote control equipment, and is a programmable amplitude shift keyed (ASK) serial communication protocol"
#string STR_SIO_IR_HELP                 #language en-US        "Infrared Remote, Support IrDA version 1.0 SIR protocol with maximum baud rate up to 115.2K bps"
                                        #language fr-FR        "Infrared Remote, Support IrDA version 1.0 SIR protocol with maximum baud rate up to 115.2K bps"                                                                              

#string STR_SIO_SERIAL_HELP             #language en-US        "Configure Serial port using options : [Disable] No Configuration [Enable] User Configuration [Auto] EFI/OS chooses configuration"
                                        #language fr-FR        "Configurer le port de Serie en utilisant: [Desactivé] Pas de Configuration [Activé] Configuration Utilisateur [Auto] EFI/OS selectionne la configuration"
#string STR_SIO_LPT_HELP                #language en-US        "Configure LPT port using options : [Disable] No Configuration [Enable] User Configuration [Auto] EFI/OS chooses configuration"
                                        #language fr-FR        "Configurer LPT de Serie en utilisant: [Desactivé] Pas de Configuration [Activé] Configuration Utilisateur [Auto] EFI/OS selectionne la configuration"

#string STR_SIO_BASEIO_STRING           #language en-US        "  Base I/O Address"
                                        #language fr-FR        "  I/O Address de Base"
#string STR_SIO_INTERRUPT_STRING        #language en-US        "  Interrupt"
                                        #language fr-FR        "  Interrompre"
#string STR_SIO_DMA_CHANNEL_STRING      #language en-US        "  DMA Channel"
                                        #language fr-FR        "  DMA Channel"

#string STR_SIO_3F8_TEXT                #language en-US        "3F8"
                                        #language fr-FR        "3F8"
#string STR_SIO_2F8_TEXT                #language en-US        "2F8"
                                        #language fr-FR        "2F8"
#string STR_SIO_3E8_TEXT                #language en-US        "3E8"
                                        #language fr-FR        "3E8"
#string STR_SIO_2E8_TEXT                #language en-US        "2E8"
                                        #language fr-FR        "2E8"
#string STR_SIO_3E0_TEXT                #language en-US        "3E0"
                                        #language fr-FR        "3E0"
#string STR_SIO_2E0_TEXT                #language en-US        "2E0"
                                        #language fr-FR        "2E0"                                        
#string STR_SIO_338_TEXT                #language en-US        "338"
                                        #language fr-FR        "338"
#string STR_SIO_228_TEXT                #language en-US        "228"
                                        #language fr-FR        "228"
#string STR_SIO_378_TEXT                #language en-US        "378"
                                        #language fr-FR        "378"
#string STR_SIO_388_TEXT                #language en-US        "388"
                                        #language fr-FR        "388"
#string STR_SIO_310_TEXT                #language en-US        "310"
                                        #language fr-FR        "310"
#string STR_SIO_320_TEXT                #language en-US        "320"
                                        #language fr-FR        "320"                                        

#string STR_PCI_IRQ3_TEXT               #language en-US        "IRQ3"
                                        #language fr-FR        "IRQ3"
#string STR_PCI_IRQ4_TEXT               #language en-US        "IRQ4"
                                        #language fr-FR        "IRQ4"
#string STR_PCI_IRQ5_TEXT               #language en-US        "IRQ5"
                                        #language fr-FR        "IRQ5"
#string STR_PCI_IRQ6_TEXT               #language en-US        "IRQ6"
                                        #language fr-FR        "IRQ6"
#string STR_PCI_IRQ7_TEXT               #language en-US        "IRQ7"
                                        #language fr-FR        "IRQ7"
#string STR_PCI_IRQ9_TEXT               #language en-US        "IRQ9"
                                        #language fr-FR        "IRQ9"
#string STR_PCI_IRQ10_TEXT              #language en-US        "IRQ10"
                                        #language fr-FR        "IRQ10"
#string STR_PCI_IRQ11_TEXT              #language en-US        "IRQ11"
                                        #language fr-FR        "IRQ11"
#string STR_PCI_IRQ12_TEXT              #language en-US        "IRQ12"
                                        #language fr-FR        "IRQ12"
#string STR_PCI_IRQ13_TEXT              #language en-US        "IRQ13"
                                        #language fr-FR        "IRQ13"
#string STR_PCI_IRQ14_TEXT              #language en-US        "IRQ14"
                                        #language fr-FR        "IRQ14"
#string STR_PCI_IRQ15_TEXT              #language en-US        "IRQ15"
                                        #language fr-FR        "IRQ15"
#string STR_PCI_IRQ16_TEXT              #language en-US        "IRQ16"
                                        #language fr-FR        "IRQ16"                                                                                                                                                                                                                                             

#string STR_SIO_BAUD_RATE               #language en-US        "Baud Rate"
                                        #language fr-FR        "Baud Rate"
#string STR_SIO_BAUD_RATE_115200        #language en-US        "115200"
                                        #language fr-FR        "115200"
#string STR_SIO_BAUD_RATE_57600         #language en-US        " 57600"
                                        #language fr-FR        " 57600"
#string STR_SIO_BAUD_RATE_38400         #language en-US        " 38400"
                                        #language fr-FR        " 38400"
#string STR_SIO_BAUD_RATE_19200         #language en-US        " 19200"
                                        #language fr-FR        " 19200"
#string STR_SIO_BAUD_RATE_9600          #language en-US        "  9600"
                                        #language fr-FR        "  9600"
#string STR_SIO_BAUD_RATE_4800          #language en-US        "  4800"
                                        #language fr-FR        "  4800"
#string STR_SIO_BAUD_RATE_2400          #language en-US        "  2400"
                                        #language fr-FR        "  2400"
#string STR_SIO_BAUD_RATE_1200          #language en-US        "  1200"
                                        #language fr-FR        "  1200"
#string STR_SIO_BAUD_RATE_300           #language en-US        "   300"
                                        #language fr-FR        "   300"

#string STR_SIO_SELECT_AUTO             #language en-US        "AUTO"
                                        #language fr-FR        "AUTO"
#string STR_SIO_SELECT_ENABLE           #language en-US        "Enable"
                                        #language fr-FR        "Enable"
#string STR_SIO_SELECT_DISABLE          #language en-US        "Disable"
                                        #language fr-FR        "Disable"

#string STR_SIO_WDT                     #language en-US        "WDT"
                                        #language fr-FR        "WDT"
#string STR_SIO_WDT_COUNT_MODE          #language en-US        "  WDT Count Mode"
                                        #language fr-FR        "  WDT Count Mode"
#string STR_SIO_SELECT_SECOND           #language en-US        "Second"
                                        #language fr-FR        "Second"
#string STR_SIO_SELECT_MINUTE           #language en-US        "Minute"
                                        #language fr-FR        "Minute"
#string STR_SIO_SELECT_MILLISECOND      #language en-US        "Millisecond"
                                        #language fr-FR        "Millisecond"
#string STR_SIO_SELECT_MILLIMINUTE      #language en-US        "Milliminute"
                                        #language fr-FR        "Milliminute"
#string STR_SIO_WDT_COUNT_MODE_HELP     #language en-US        "Select count mode"
                                        #language fr-FR        "Select count mode"
#string STR_SIO_WDT_COUNTER             #language en-US        "  Counter"
                                        #language fr-FR        "  Counter"
#string STR_SIO_WDT_COUNTER_HELP        #language en-US        "The time-out counter."
                                        #language fr-FR        "The time-out counter."

#string FUNCTION_NINE_STRING            #language en-US         "F9=Reset to Defaults"
                                        #language fr-FR         "F9=Reset à Défauts"
#string FUNCTION_TEN_STRING             #language en-US         "F10=Save"
                                        #language fr-FR         "F10=Économiser"

#string STR_SAVE_CHANGES                #language en-US        "Save Changes and Exit"
                                        #language fr-FR        "Save Changes and Exit"

#string STR_SIO_ESC                     #language en-US        "Press ESC to exit."
                                        #language fr-FR        "Press ESC to exit."
#string STR_SIO_EMPTY                   #language en-US        ""
                                        #language fr-FR        ""

#string STR_SIO_MODE_SELECTION          #language en-US        "  Mode"
                                        #language fr-FR        "  Mode"

#string STR_SIO_COM_RS232               #language en-US        "RS232"
                                        #language fr-FR        "RS232"   
#string STR_SIO_COM_RS485               #language en-US        "RS485"
                                        #language fr-FR        "RS485"
#string STR_SIO_COM_RS422               #language en-US        "RS422"
                                        #language fr-FR        "RS422"
#string STR_SIO_COM_MODE_HELP           #language en-US        "Choose COM Port Mode"
                                        #language fr-FR        "Choose COM Port Mode"
										    					    
#string STR_SIO_LEVEL_TRIGGERED              #language en-US   "Level Triggered"
                                             #language fr-FR   "Level Triggered"
#string STR_SIO_EDGE_TRIGGERED               #language en-US   "Edge Triggered"
                                             #language fr-FR   "Edge Triggered"
#string STR_SIO_INTERRUPT_MODE_SELECTION     #language en-US   "  Interrupt Mode"
                                             #language fr-FR   "  Interrupt Mode"
#string STR_SIO_INTERRUPT_MODE_HELP          #language en-US   "Set ACPI IRQ Information: Selection Interrupt Mode"
                                             #language fr-FR   "Set ACPI IRQ Information: Selection Interrupt Mode"
#string STR_SIO_ACTIVE_HIGH                  #language en-US   "Active High"
                                             #language fr-FR   "Active High"
#string STR_SIO_ACTIVE_LOW                   #language en-US   "Active Low"
                                             #language fr-FR   "Active Low"
#string STR_SIO_INTERRUPT_POLARITY_SELECTION #language en-US   "  Interrupt Polarity"
                                             #language fr-FR   "  Interrupt Polarity"
#string STR_SIO_INTERRUPT_POLARITY_HELP      #language en-US   "Set ACPI IRQ Information: Selection Interrupt Polarity"
                                             #language fr-FR   "Set ACPI IRQ Information: Selection Interrupt Polarity"
#string STR_SIO_INTERRUPT_SHARING_SELECTION  #language en-US   "  Interrupt Sharing"
                                             #language fr-FR   "  Interrupt Sharing"
#string STR_SIO_INTERRUPT_SHARING_HELP       #language en-US   "Set ACPI IRQ Information: Selection Interrupt Sharing"
                                             #language fr-FR   "Set ACPI IRQ Information: Selection Interrupt Sharing"
#string STR_SIO_INTERRUPT_EXCLUSIVE          #language en-US   "Exclusive"
                                             #language fr-FR   "Exclusive" 
#string STR_SIO_INTERRUPT_SHARED             #language en-US   "Shared"
                                             #language fr-FR   "Shared

#string STR_SIO_LPT_SPP                 #language en-US        "SPP"
                                        #language fr-FR        "SPP"
#string STR_SIO_LPT_EPP                 #language en-US        "EPP"
                                        #language fr-FR        "EPP"
#string STR_SIO_LPT_ECP                 #language en-US        "ECP"
                                        #language fr-FR        "ECP"
#string STR_SIO_LPT_ECP_EPP             #language en-US        "ECP & EPP"
                                        #language fr-FR        "ECP & EPP"
#string STR_SIO_LPT_ECP_SPP             #language en-US        "ECP & SPP"
                                        #language fr-FR        "ECP & SPP"
#string STR_SIO_LPT_EPP_SPP             #language en-US        "EPP & SPP"
                                        #language fr-FR        "EPP & SPP"
#string STR_SIO_LPT_PRINT               #language en-US        "Print"
                                        #language fr-FR        "Print"
#string STR_SIO_LPT_MODE_HELP           #language en-US        "Choose Parallel Port Mode"
                                        #language fr-FR        "Choose Parallel Port Mode"

#string STR_SIO_FIFO                    #language en-US        "  FIFO"
#string STR_SIO_FIFO_HELP               #language en-US        "  FIFO Setting"
#string STR_SIO_FIFO_LEVEL              #language en-US        "    FIFO Level"
#string STR_SIO_FIFO_LEVEL_HELP         #language en-US        "FIFO Interrupt Active Level Mode Select"
#string STR_SIO_FIFO_LEVEL_1_BYTE       #language en-US        "RX FIFO 1 Byte"
#string STR_SIO_FIFO_LEVEL_4_BYTE       #language en-US        "RX FIFO 4 Bytes"
#string STR_SIO_FIFO_LEVEL_8_BYTE       #language en-US        "RX FIFO 8 Bytes"
#string STR_SIO_FIFO_LEVEL_14_BYTE      #language en-US        "RX FIFO 14 Bytes"
#string STR_SIO_FIFO_LEVEL_16_BYTE      #language en-US        "RX FIFO 16 Bytes"
#string STR_SIO_FIFO_LEVEL_32_BYTE      #language en-US        "RX FIFO 32 Bytes"
#string STR_SIO_FIFO_LEVEL_48_BYTE      #language en-US        "RX FIFO 48 Bytes"
#string STR_SIO_FIFO_LEVEL_64_BYTE      #language en-US        "RX FIFO 64 Bytes"
#string STR_SIO_FIFO_LEVEL_80_BYTE      #language en-US        "RX FIFO 80 Bytes"
#string STR_SIO_FIFO_LEVEL_88_BYTE      #language en-US        "RX FIFO 88 Bytes"
#string STR_SIO_FIFO_LEVEL_96_BYTE      #language en-US        "RX FIFO 96 Bytes"
#string STR_SIO_FIFO_LEVEL_104_BYTE     #language en-US        "RX FIFO 104 Bytes"
#string STR_SIO_FIFO_LEVEL_112_BYTE     #language en-US        "RX FIFO 112 Bytes"
#string STR_SIO_FIFO_LEVEL_116_BYTE     #language en-US        "RX FIFO 116 Bytes"
#string STR_SIO_FIFO_LEVEL_120_BYTE     #language en-US        "RX FIFO 120 Bytes"
#string STR_SIO_FIFO_LEVEL_124_BYTE     #language en-US        "RX FIFO 124 Bytes"
#string STR_SIO_FIFO_LEVEL_128_BYTE     #language en-US        "TX and RX FIFO 128 Bytes"

#string STR_SIO_LED_CONFIG                    #language en-US        "LED Configuration"
                                              #language fr-FR        "LED Configuration"
#string STR_SIO_LED_BLINK_DUTY_CYCLE          #language en-US        "LED Blink Duty Cycle"
                                              #language fr-FR        "LED Blink Duty Cycle"
#string STR_SIO_LED_POLARITY                  #language en-US        "LED Polarity"
                                              #language fr-FR        "LED Polarity"
#string STR_SIO_LED_POLARITY_ACTIVE_HIGH      #language en-US        "Active High"
                                              #language fr-FR        "Active High"
#string STR_SIO_LED_POLARITY_ACTIVE_LOW       #language en-US        "Active Low"
                                              #language fr-FR        "Active Low"
#string STR_SIO_LED_OUTPUT_SIGNAL_S0          #language en-US        "  LED Output Signal in S0  "
                                              #language fr-FR        "  LED Output Signal in S0  "
#string STR_SIO_LED_OUTPUT_SIGNAL_S0_HELP     #language en-US        "LED flash frequency in S0"
                                              #language fr-FR        "LED flash frequency in S0"
#string STR_SIO_LED_OUTPUT_SIGNAL_S3          #language en-US        "  LED Output Signal in S3  "
                                              #language fr-FR        "  LED Output Signal in S3  "
#string STR_SIO_LED_OUTPUT_SIGNAL_S3_HELP     #language en-US        "LED flash frequency in S3"
                                              #language fr-FR        "LED flash frequency in S3"
#string STR_SIO_LED_OUTPUT_SIGNAL_S5          #language en-US        "  LED Output Signal in S5  "
                                              #language fr-FR        "  LED Output Signal in S5  "
#string STR_SIO_LED_OUTPUT_SIGNAL_S5_HELP     #language en-US        "LED flash frequency in S5"
                                              #language fr-FR        "LED flash frequency in S5"
#string STR_SIO_LED_OUTPUT_SIGNAL_DEEPS3      #language en-US        "  LED Output Signal in DeepS3  "
                                              #language fr-FR        "  LED Output Signal in DeepS3  "
#string STR_SIO_LED_OUTPUT_SIGNAL_DEEPS3_HELP #language en-US        "LED flash frequency in DeepS3"
                                              #language fr-FR        "LED flash frequency in DeepS3"
#string STR_SIO_LED_OUTPUT_SIGNAL_DEEPS5      #language en-US        "  LED Output Signal in DeepS5  "
                                              #language fr-FR        "  LED Output Signal in DeepS5  "
#string STR_SIO_LED_OUTPUT_SIGNAL_DEEPS5_HELP #language en-US        "LED flash frequency in DeepS5"
                                              #language fr-FR        "LED flash frequency in DeepS5"
#string STR_SIO_LED_OUTPUT_SIGNAL_DEEP_SLEEP_WELL      #language en-US        "  LED Output Signal in DeepSleepWell  "
                                                       #language fr-FR        "  LED Output Signal in DeepSleepWell  "
#string STR_SIO_LED_OUTPUT_SIGNAL_DEEP_SLEEP_WELL_HELP #language en-US        "LED flash frequency in DeepSleepWell"
                                                       #language fr-FR        "LED flash frequency in DeepSleepWell"

#string STR_SIO_LED_ENABLE_POWER_STATE_S3TOS5      #language en-US        "Blink preserved under S3~S5"
                                                   #language fr-FR        "Blink preserved under S3~S5"
#string STR_SIO_LED_ENABLE_POWER_STATE_S3TOS5_HELP #language en-US        "Blink preserved under S3~S5"
                                                   #language fr-FR        "Blink preserved under S3~S5"
#string STR_SIO_LED_ENABLE_POWER_STATE_DEEPS3      #language en-US        "Enable DeepS3"
                                                   #language fr-FR        "Enable DeepS3"
#string STR_SIO_LED_ENABLE_POWER_STATE_DEEPS3_HELP #language en-US        "Enable DeepS3"
                                                   #language fr-FR        "Enable DeepS3"
#string STR_SIO_LED_ENABLE_POWER_STATE_DEEPS5      #language en-US        "Enable DeepS5"
                                                   #language fr-FR        "Enable DeepS5"
#string STR_SIO_LED_ENABLE_POWER_STATE_DEEPS5_HELP #language en-US        "Enable DeepS5"
                                                   #language fr-FR        "Enable DeepS5"

#string STR_SIO_LED_ADDITIONAL_FEATURE        #language en-US        "Additional Feature"
                                              #language fr-FR        "Additional Feature"
#string STR_SIO_LED_OSCILLATE_PHASE           #language en-US        "Osciilate Phase"
                                              #language fr-FR        "Osciilate Phase"
#string STR_SIO_LED_OSCILLATE_PHASE_HELP      #language en-US        "Osciilate Phase Select"
                                              #language fr-FR        "Osciilate Phase Select"
#string STR_SIO_LED_OSCILLATE_PHASE_DIFFER    #language en-US        "Different"
                                              #language fr-FR        "Different"
#string STR_SIO_LED_OSCILLATE_PHASE_THE_SAME  #language en-US        "The same"
                                              #language fr-FR        "The same"
#string STR_SIO_LED_AUTOMATIC_MODE            #language en-US        "Automatic Mode"
                                              #language fr-FR        "Automatic Mode"
#string STR_SIO_LED_AUTOMATIC_MODE_HELP       #language en-US        "Automatic Mode Enable/Disable"
                                              #language fr-FR        "Automatic Mode Enable/Disable"
#string STR_SIO_LED_BLINK_PATTERN             #language en-US        "Blink Pattern"
                                              #language fr-FR        "Blink Pattern"
#string STR_SIO_LED_BLINK_PATTERN_HELP        #language en-US        "Select Blink Pattern"
                                              #language fr-FR        "Select Blink Pattern"
#string STR_SIO_LED_BLINK_PATTERN_1           #language en-US        "1 blinks followed by 2 sec pause"
                                              #language fr-FR        "1 blinks followed by 2 sec pause"
#string STR_SIO_LED_BLINK_PATTERN_2           #language en-US        "2 blinks followed by 2 sec pause"
                                              #language fr-FR        "2 blinks followed by 2 sec pause"
#string STR_SIO_LED_BLINK_PATTERN_3           #language en-US        "3 blinks followed by 2 sec pause"
                                              #language fr-FR        "3 blinks followed by 2 sec pause"
#string STR_SIO_LED_BLINK_PATTERN_4           #language en-US        "4 blinks followed by 2 sec pause"
                                              #language fr-FR        "4 blinks followed by 2 sec pause"
#string STR_SIO_LED_CLOCK_INVERT              #language en-US        "Clock Invert"
                                              #language fr-FR        "Clock Invert"
#string STR_SIO_LED_CLOCK_INVERT_HELP         #language en-US        "Clock Invert Enable/Disable"
                                              #language fr-FR        "Clock Invert Enable/Disable"

#string STR_SIO_FADING_LED_CONFIG             #language en-US        "Fading LED Configuration"
                                              #language fr-FR        "Fading LED Configuration"
#string STR_SIO_FADING_LED_DISPLAY_MODE       #language en-US        "Fading LED Display Mode"
                                              #language fr-FR        "Fading LED Display Mode"
#string STR_SIO_FADING_LED_FADING_MODE        #language en-US        "Fading Led"
                                              #language fr-FR        "Fading Led"
#string STR_SIO_FADING_LED_BLINK_MODE         #language en-US        "Blink Led"
                                              #language fr-FR        "Blink Led"
#string STR_SIO_FADING_LED_SOLID_MODE         #language en-US        "Solid Led"
                                              #language fr-FR        "Solid Led"
#string STR_SIO_FADING_LED_MAXIMUM_DUTY_CYCLE #language en-US        "Maximum Duty Cycle"
                                              #language fr-FR        "Maximum Duty Cycle"
#string STR_SIO_FADING_LED_MIDDLE_DUTY_CYCLE  #language en-US        "Middle Duty Cycle"
                                              #language fr-FR        "Middle Duty Cycle"
#string STR_SIO_FADING_LED_MINIMUM_DUTY_CYCLE #language en-US        "Minimum Duty Cycle"
                                              #language fr-FR        "Minimum Duty Cycle"
#string STR_SIO_FADING_LED_INCREASE_DUTY_CYCLE #language en-US        "Increase Duty Cycle"
                                               #language fr-FR        "Increase Duty Cycle"
#string STR_SIO_FADING_LED_DECREASE_DUTY_CYCLE #language en-US        "Decrease Duty Cycle"
                                               #language fr-FR        "Decrease Duty Cycle"
#string STR_SIO_FADING_LED_REPEAT_DUTY_CYCLE   #language en-US        "Repeat Duty Cycle"
                                               #language fr-FR        "Repeat Duty Cycle"
#string STR_SIO_FADING_EXTEND                  #language en-US        "Fading Extend "
                                               #language fr-FR        "Fading Extend"
#string STR_SIO_FADING_EXTEND_NONE             #language en-US        "Fading Extend None"
                                               #language fr-FR        "Fading Extend None"
#string STR_SIO_FADING_EXTEND_MAXIMUM          #language en-US        "Fading Extend Maximum"
                                               #language fr-FR        "Fading Extend Maximum"
#string STR_SIO_FADING_EXTEND_MINIMUM          #language en-US        "Fading Extend Minimum"
                                               #language fr-FR        "Fading Extend Minimum"
#string STR_SIO_FADING_EXTEND_BOTH             #language en-US        "Fading Extend Both"
                                               #language fr-FR        "Fading Extend Both"
#string STR_SIO_FADING_LIGHT_EXTEND_TIME       #language en-US        "Light Extend Time"
                                               #language fr-FR        "Light Extend Time"
#string STR_SIO_FADING_DARK_EXTEND_TIME        #language en-US        "Dark Extend Time"
                                               #language fr-FR        "Dark Extend Time"
#string STR_SIO_FADING_FREQ_DIVIDE             #language en-US        "Fading Frequency Divide"
                                               #language fr-FR        "Fading Frequency Divide"
#string STR_SIO_BLINK_MODE_FADING_FREQ         #language en-US        "Blink Mode Fading Frequency"
                                               #language fr-FR        "Blink Mode Fading Frequency"
#string STR_SIO_DUTY_CYCLE_CHANGE_FREQ         #language en-US        "Duty Cycle Change Frequency"
                                               #language fr-FR        "Duty Cycle Change Frequency"

#string STR_GPIO0X_FORM_TITLE                   #language en-US        "GPIO Group 0 Configuration"
#string STR_GPIO1X_FORM_TITLE                   #language en-US        "GPIO Group 1 Configuration"
#string STR_GPIO2X_FORM_TITLE                   #language en-US        "GPIO Group 2 Configuration"
#string STR_GPIO3X_FORM_TITLE                   #language en-US        "GPIO Group 3 Configuration"
#string STR_GPIO4X_FORM_TITLE                   #language en-US        "GPIO Group 4 Configuration"
#string STR_GPIO5X_FORM_TITLE                   #language en-US        "GPIO Group 5 Configuration"
#string STR_GPIO6X_FORM_TITLE                   #language en-US        "GPIO Group 6 Configuration"
#string STR_GPIO7X_FORM_TITLE                   #language en-US        "GPIO Group 7 Configuration"
#string STR_GPIO8X_FORM_TITLE                   #language en-US        "GPIO Group 8 Configuration"
#string STR_GPIO1X_STRING                       #language en-US        "General Purpose Group 1 Input/Output"
#string STR_GPIO2X_STRING                       #language en-US        "General Purpose Group 2 Input/Output"
#string STR_GPIO3X_STRING                       #language en-US        "General Purpose Group 3 Input/Output"
#string STR_GPIO4X_STRING                       #language en-US        "General Purpose Group 4 Input/Output"
#string STR_GPIO5X_STRING                       #language en-US        "General Purpose Group 5 Input/Output"
#string STR_GPIO6X_STRING                       #language en-US        "General Purpose Group 6 Input/Output"
#string STR_GPIO7X_STRING                       #language en-US        "General Purpose Group 7 Input/Output"
#string STR_GPIO8X_STRING                       #language en-US        "General Purpose Group 8 Input/Output"
#string STR_GPIO_INTERNAL_RESISTANCE            #language en-US        "Internal Resistance"
#string STR_GPIO_INTERNAL_HELP_STRING           #language en-US        "User can pull internal resistance high/low"
#string STR_GPIO_INTERNAL_HELP_STRING2          #language en-US        "User can pull internal resistance push-pull/open-drain"
#string STR_GPIO_POLARITY                       #language en-US        "GPIO Polarity"
#string STR_GPIO_POLARITY_HELP_STRING           #language en-US        "Invert the GPIO signal"
#string STR_GPIO_IN_OUT                         #language en-US        "Input/Output Mode"
#string STR_GPIO_IN_OUT_HELP_STRING             #language en-US        "Set the GPIO pin is input or output"
#string STR_GPIO_OUT_VALUE                      #language en-US        "Pei Phase Output Value"
#string STR_GPIO_OUT2_VALUE                     #language en-US        "Dxe Phase Output Value"
#string STR_GPIO_OUT_VALUE_HELP_STRING          #language en-US        "Set output port high/low value"
#string STR_GPIO_PULL_DOWN                      #language en-US        "Pull Down"
#string STR_GPIO_PULL_UP                        #language en-US        "Pull up"
#string STR_GPIO_PUSH_PULL                      #language en-US        "Push Pull"
#string STR_GPIO_OPEN_DRAIN                     #language en-US        "Open Drain"
#string STR_GPIO_INPUT                          #language en-US        "Input"
#string STR_GPIO_OUTPUT                         #language en-US        "Output"
#string STR_GPIO_HIGH                           #language en-US        "High"
#string STR_GPIO_LOW                            #language en-US        "Low"

#string STR_SIO_POWER_LOSS_SETTING               #language en-US        "Power loss setting"
#string STR_SIO_POWER_LOSS_SETTING_HELP          #language en-US        "System turn on or off after AC resume"
#string STR_SIO_POWER_LOSS_SETTING_ALWAYS_ON     #language en-US        "Always on"
#string STR_SIO_POWER_LOSS_SETTING_ALWAYS_OFF    #language en-US        "Always off"
#string STR_SIO_POWER_LOSS_SETTING_LAST_STATE    #language en-US        "Last State"
#string STR_SIO_POWER_LOSS_SETTING_WITHOUT_PSOUT #language en-US        "Always on without PSOUT#"
#string STR_SIO_POWER_LOSS_SETTING_USER_DEFINE   #language en-US        "User define"
#string STR_SIO_POWER_LOSS_USER_DEFINE           #language en-US        "User define"
#string STR_SIO_POWER_LOSS_USER_DEFINE_HELP      #language en-US        "User defines the resuming state before power loss"
#string STR_SIO_POWER_LOSS_USER_DEFINE_ON        #language en-US        "ON"
#string STR_SIO_POWER_LOSS_USER_DEFINE_OFF       #language en-US        "OFF"

#string STR_SIO_PME_CONFIG                       #language en-US        "PME Configuration"
#string STR_SIO_PME_ENABLE                       #language en-US        "Enable"
#string STR_SIO_PME_DISABLE                      #language en-US        "Disable"
#string STR_SIO_PME_UART_SETTING                 #language en-US        "UART"
#string STR_SIO_PME_UART_SETTING_HELP            #language en-US        "PME interrupt of the UART IRQ event"
#string STR_SIO_PME_UART_A_SETTING               #language en-US        "UART A"
#string STR_SIO_PME_UART_A_SETTING_HELP          #language en-US        "PME interrupt of the UART A IRQ event"
#string STR_SIO_PME_UART_B_SETTING               #language en-US        "UART B"
#string STR_SIO_PME_UART_B_SETTING_HELP          #language en-US        "PME interrupt of the UART B IRQ event"
#string STR_SIO_PME_UART_C_SETTING               #language en-US        "UART C"
#string STR_SIO_PME_UART_C_SETTING_HELP          #language en-US        "PME interrupt of the UART C IRQ event"
#string STR_SIO_PME_UART_D_SETTING               #language en-US        "UART D"
#string STR_SIO_PME_UART_D_SETTING_HELP          #language en-US        "PME interrupt of the UART D IRQ event"
#string STR_SIO_PME_UART_E_SETTING               #language en-US        "UART E"
#string STR_SIO_PME_UART_E_SETTING_HELP          #language en-US        "PME interrupt of the UART E IRQ event"
#string STR_SIO_PME_UART_F_SETTING               #language en-US        "UART F"
#string STR_SIO_PME_UART_F_SETTING_HELP          #language en-US        "PME interrupt of the UART F IRQ event"
#string STR_SIO_PME_FLOPPY_SETTING               #language en-US        "FLOPPY"
#string STR_SIO_PME_FLOPPY_SETTING_HELP          #language en-US        "PME interrupt of the FLOPPY IRQ event"
#string STR_SIO_PME_LPT_SETTING                  #language en-US        "LPT"
#string STR_SIO_PME_LPT_SETTING_HELP             #language en-US        "PME interrupt of the LPT IRQ event"
#string STR_SIO_PME_KYBD_SETTING                 #language en-US        "KBC"
#string STR_SIO_PME_KYBD_SETTING_HELP            #language en-US        "PME interrupt of the KBC IRQ event"
#string STR_SIO_PME_MOUSE_SETTING                #language en-US        "MOUSE"
#string STR_SIO_PME_MOUSE_SETTING_HELP           #language en-US        "PME interrupt of the MOUSE IRQ event"
#string STR_SIO_PME_IR_SETTING                   #language en-US        "IR"
#string STR_SIO_PME_IR_SETTING_HELP              #language en-US        "PME interrupt of the IR IRQ event"
#string STR_SIO_PME_CIR_SETTING                  #language en-US        "CIR"
#string STR_SIO_PME_CIR_SETTING_HELP             #language en-US        "PME interrupt of the CIR IRQ event"
#string STR_SIO_PME_HWM_SETTING                  #language en-US        "HWM"
#string STR_SIO_PME_HWM_SETTING_HELP             #language en-US        "PME interrupt of the HWM IRQ event"
#string STR_SIO_PME_WDT_SETTING                  #language en-US        "WDT"
#string STR_SIO_PME_WDT_SETTING_HELP             #language en-US        "PME interrupt of the WDT IRQ event"
#string STR_SIO_PME_UNKNOWN_SETTING              #language en-US        "Unknown"
#string STR_SIO_PME_UNKNOWN_SETTING_HELP         #language en-US        "Unknown device"